package Lesson16;

/*       Задача
Есть текст, когда попадается заглавная буква она пишется с новой строчки пока не пападётся опять заглавная буква.
 */
public class test4 {
    public static void main(String[] args) {
        String s1 = "Жоден вірш українською мовою не здобув такого широкого визнання серед у світі, як Шевченків \"Заповіт\". Твір пройнятий прагненням бачити прекрасну людину на прекрасній землі. Поет вірить у те, що Україна стане незалежною, люди прозріють, а брехню буде знищено. І ми повинні виправдати його сподівання, здолати всі труднощі на шляху нашої країни до щасливого майбутнього. "
                ;
        String s2 = s1.toUpperCase();
        char c1;
        char c2;

        for (int i = 0; i < s1.length(); i++) {
            c1 = s1.charAt(i);
            c2 = s2.charAt(i);
            if (c1 != ',' && c1 != '!' && c1 != '.' && c1 != ' '&& c1 != '"' && c1 == c2) {
                System.out.println();
                System.out.print(c1);
                continue;


            }
            System.out.print(c1);
        }
        System.out.println();
    }

}
